andreim2k/aMonitoringHub/esp32cam/src/main.cpp
/*
 * ESP32-CAM Advanced Capture Server
 *
 * Features:
 * - Modular architecture with separate components
 * - Configuration management with EEPROM storage
 * - High-resolution photo capture with configurable resolution
 * - Smart flash control with PWM brightness adjustment
 * - Auto flash based on ambient light detection
 * - Comprehensive REST API with JSON parsing
 * - Clean separation of concerns
 *
 * Author: ESP32-CAM Project
 * Version: 2.1 - Modular Architecture
 */

#include "esp_heap_caps.h" // Memory monitoring
#include "esp_system.h"    // Stack overflow protection
#include "esp_task_wdt.h"  // Watchdog timer
#include "esp_wifi.h"      // For low-level WiFi power control
#include "modules/camera.h"
#include "modules/config.h"
#include "modules/flash.h"
#include "modules/webserver.h"
#include <ArduinoOTA.h>
#include <ESP32Ping.h>
#include <WiFi.h>

// ===================
// CRASH PREVENTION & MONITORING
// ===================

// Forward declarations
void initOTA();

// Global variables for monitoring
unsigned long last_wifi_check = 0;
unsigned long last_memory_check = 0;
unsigned long last_watchdog_reset = 0;
bool ota_initialized = false;
const unsigned long WIFI_CHECK_INTERVAL = 30000;                    // 30 seconds
const unsigned long MEMORY_CHECK_INTERVAL = 60000;                  // 60 seconds
const unsigned long WATCHDOG_RESET_INTERVAL = 10000;                // 10 seconds
const unsigned long DAILY_RESTART_MS = 24UL * 60UL * 60UL * 1000UL; // 24 hours

// Gateway ping monitoring — reboot after 12 consecutive failures (~3 min)
const IPAddress GATEWAY_PING_IP(192, 168, 50, 1);
const unsigned long PING_CHECK_INTERVAL = 15000; // 15 seconds between pings
const int PING_FAIL_REBOOT_THRESHOLD = 12;       // 12 × 15s = 3 min
unsigned long last_ping_time = 0;
int gateway_ping_fail_count = 0;

// WiFi runtime reconnect failure counter — reboot after 10 consecutive failures (~5 min)
const int WIFI_RECONNECT_REBOOT_THRESHOLD = 10;
int wifi_reconnect_fail_count = 0;

// WiFi reconnect request from web UI
volatile bool wifi_reconnect_requested = false;

/**
 * Helper to convert IPAddress to char array safely
 */
void ipToCharArray(const IPAddress &ip, char *buffer, size_t buf_size) {
  ip.toString().toCharArray(buffer, buf_size);
}

/**
 * Initialize watchdog timer for crash prevention
 */
void initWatchdog() {
  Serial.println("Initializing watchdog timer...");

  // Initialize watchdog with 30 second timeout
  esp_task_wdt_init(30, true);

  // Add current task to watchdog
  esp_task_wdt_add(NULL);

  Serial.println("Watchdog timer initialized (30s timeout)");
}

/**
 * Initialize stack overflow protection
 */
void initStackProtection() {
  Serial.println("Initializing stack overflow protection...");

  // Stack overflow protection is already enabled by esp_task_wdt_add(NULL) in
  // initWatchdog() ESP32 automatically detects stack overflows when watchdog is
  // active
  Serial.println("Stack overflow protection enabled (via watchdog)");
}

/**
 * Reset watchdog timer (call regularly in main loop)
 */
void resetWatchdog() {
  unsigned long now = millis();
  if (now - last_watchdog_reset >= WATCHDOG_RESET_INTERVAL) {
    esp_task_wdt_reset();
    last_watchdog_reset = now;
  }
}

/**
 * Monitor memory usage and log warnings
 */
void checkMemoryUsage() {
  unsigned long now = millis();
  if (now - last_memory_check >= MEMORY_CHECK_INTERVAL) {
    size_t free_heap = esp_get_free_heap_size();
    size_t min_free_heap = esp_get_minimum_free_heap_size();
    size_t total_heap = heap_caps_get_total_size(MALLOC_CAP_8BIT);

    Serial.printf(
        "Memory Status: Free=%u bytes, Min Free=%u bytes, Total=%u bytes\n",
        free_heap, min_free_heap, total_heap);

    // Warning thresholds
    if (free_heap < 50000) { // Less than 50KB free
      Serial.println("WARNING: Low memory detected!");
    }

    if (min_free_heap < 30000) { // Less than 30KB minimum
      Serial.println("CRITICAL: Very low memory detected!");
    }

    last_memory_check = now;
  }
}

/**
 * Apply WiFi bandwidth mode (802.11b/HT20/HT40)
 */
void applyWiFiBandwidthMode() {
  uint8_t bwMode = configManager.getWiFiBandwidthMode();
  esp_err_t err = esp_wifi_set_max_tx_power(78);
  if (err != ESP_OK) {
    Serial.printf("Failed to set WiFi max TX power: 0x%x\n", err);
  }

  switch (bwMode) {
    case WIFI_BW_MODE_HT20:
      err = esp_wifi_set_protocol(WIFI_IF_STA,
          WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
      if (err != ESP_OK) {
        Serial.printf("Failed to set WiFi protocol: 0x%x\n", err);
      }
      err = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT20);
      if (err != ESP_OK) {
        Serial.printf("Failed to set WiFi bandwidth HT20: 0x%x\n", err);
      }
      Serial.println("WiFi bandwidth mode: HT20");
      break;
    case WIFI_BW_MODE_HT40:
      err = esp_wifi_set_protocol(WIFI_IF_STA,
          WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
      if (err != ESP_OK) {
        Serial.printf("Failed to set WiFi protocol: 0x%x\n", err);
      }
      err = esp_wifi_set_bandwidth(WIFI_IF_STA, WIFI_BW_HT40);
      if (err != ESP_OK) {
        Serial.printf("Failed to set WiFi bandwidth HT40: 0x%x\n", err);
      }
      Serial.println("WiFi bandwidth mode: HT40");
      break;
    default: // WIFI_BW_MODE_11B
      err = esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B);
      if (err != ESP_OK) {
        Serial.printf("Failed to set WiFi protocol 11b: 0x%x\n", err);
      }
      Serial.println("WiFi bandwidth mode: 802.11b long-range");
      break;
  }
}

/**
 * Print visible WiFi networks when association fails.
 */
void printWiFiScanDiagnostics() {
  Serial.println("Scanning visible WiFi networks...");
  WiFi.disconnect(false, false);
  delay(500);
  WiFi.mode(WIFI_STA);
  delay(100);

  int network_count = WiFi.scanNetworks(false, true);

  if (network_count < 0) {
    Serial.printf("WiFi scan failed: %d\n", network_count);
    return;
  }

  Serial.printf("WiFi scan found %d network(s)\n", network_count);
  for (int i = 0; i < network_count; i++) {
    Serial.printf("  %d: SSID='%s', RSSI=%d dBm, Channel=%d, Encryption=%d\n",
                  i + 1, WiFi.SSID(i).c_str(), WiFi.RSSI(i),
                  WiFi.channel(i), WiFi.encryptionType(i));
  }

  WiFi.scanDelete();
}

/**
 * Check WiFi connection and attempt reconnection if needed
 */
void checkWiFiConnection() {
  unsigned long now = millis();
  if (now - last_wifi_check >= WIFI_CHECK_INTERVAL) {
    if (WiFi.status() != WL_CONNECTED) {
      Serial.println("WiFi disconnected, attempting reconnection...");

      // Attempt reconnection
      WiFi.disconnect();
      delay(1000);
      applyWiFiBandwidthMode();
      WiFi.begin(configManager.getWiFiSSID(), configManager.getWiFiPassword());

      // Wait for connection with timeout
      int attempts = 0;
      while (WiFi.status() != WL_CONNECTED && attempts < 20) {
        esp_task_wdt_reset();
        delay(500);
        attempts++;
        Serial.print(".");
      }

      if (WiFi.status() == WL_CONNECTED) {
        Serial.println();
        Serial.println("WiFi reconnected successfully");
        gateway_ping_fail_count = 0;
        wifi_reconnect_fail_count = 0;
        char ip_str[16];
        WiFi.localIP().toString().toCharArray(ip_str, sizeof(ip_str));
        Serial.printf("IP Address: %s\n", ip_str);
        webServerManager.stop();
        delay(100);
        webServerManager.begin();
        initOTA();
        Serial.println("HTTP server and OTA restarted after WiFi reconnect");
      } else {
        Serial.println();
        wifi_reconnect_fail_count++;
        Serial.printf("WiFi reconnection failed (%d/%d)\n",
                      wifi_reconnect_fail_count, WIFI_RECONNECT_REBOOT_THRESHOLD);
        if (wifi_reconnect_fail_count >= WIFI_RECONNECT_REBOOT_THRESHOLD) {
          Serial.println("FATAL: WiFi unreachable too long — rebooting");
          esp_task_wdt_reset();
          delay(500);
          ESP.restart();
        }
      }
    }
    last_wifi_check = now;
  }
}

/**
 * Emergency recovery function for critical failures
 */
void emergencyRecovery() {
  Serial.println("EMERGENCY RECOVERY: Attempting system recovery...");

  // Reset watchdog to prevent immediate restart
  esp_task_wdt_reset();

  // Attempt to restart WiFi
  WiFi.disconnect();
  delay(2000);
  WiFi.begin(configManager.getWiFiSSID(), configManager.getWiFiPassword());

  // Wait briefly for WiFi
  delay(5000);

  // Restart web server if WiFi is connected
  if (WiFi.status() == WL_CONNECTED) {
    webServerManager.stop();
    delay(1000);
    webServerManager.begin();
    Serial.println("Emergency recovery completed");
  } else {
    Serial.println("Emergency recovery failed - manual intervention required");
  }
}

// ===================
// OTA UPDATE
// ===================

void initOTA() {
  if (ota_initialized) {
    return; // Already initialized, skip to avoid double-initialization issues
  }

  ArduinoOTA.setHostname(configManager.getDeviceName());

  ArduinoOTA.onStart([]() {
    String type = (ArduinoOTA.getCommand() == U_FLASH) ? "sketch" : "filesystem";
    Serial.printf("OTA Start: updating %s\n", type.c_str());
    esp_task_wdt_reset();
    webServerManager.stop(); // free TCP socket during upload
    cameraManager.deinit();  // free PSRAM frame buffers before flash erase
    delay(100);
  });

  ArduinoOTA.onEnd([]() {
    Serial.println("OTA complete");
  });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    esp_task_wdt_reset(); // keep watchdog alive during long upload
    Serial.printf("OTA: %u%%\r", progress / (total / 100));
  });

  ArduinoOTA.onError([](ota_error_t error) {
    const char* msg = "unknown";
    if      (error == OTA_AUTH_ERROR)    msg = "auth failed";
    else if (error == OTA_BEGIN_ERROR)   msg = "begin failed";
    else if (error == OTA_CONNECT_ERROR) msg = "connect failed";
    else if (error == OTA_RECEIVE_ERROR) msg = "receive failed";
    else if (error == OTA_END_ERROR)     msg = "end failed";
    Serial.printf("OTA Error: %s\n", msg);
    webServerManager.begin(); // restore server after failed OTA
  });

  ArduinoOTA.begin();
  ota_initialized = true;
  char ip_str[16];
  WiFi.localIP().toString().toCharArray(ip_str, sizeof(ip_str));
  Serial.printf("OTA ready — hostname: %s, IP: %s, port: 3232\n",
                configManager.getDeviceName(), ip_str);
}

// ===================
// WIFI MANAGEMENT
// ===================

/**
 * Initialize WiFi connection using configuration
 */
void initWiFi() {
  Serial.println("========== WiFi Configuration ==========");
  Serial.printf("SSID: %s\n", configManager.getWiFiSSID());

  WiFi.disconnect(true, true);
  delay(200);
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);

  // Configure IP settings
  if (configManager.useStaticIP()) {
    Serial.println("Configuring Static IP...");
    IPAddress staticIP = configManager.getStaticIP();
    IPAddress gateway = configManager.getGateway();
    IPAddress subnet = configManager.getSubnet();
    IPAddress primaryDNS = configManager.getPrimaryDNS();
    IPAddress secondaryDNS = configManager.getSecondaryDNS();

    char ip_str[16], gateway_str[16], subnet_str[16], dns1_str[16],
        dns2_str[16];
    staticIP.toString().toCharArray(ip_str, sizeof(ip_str));
    gateway.toString().toCharArray(gateway_str, sizeof(gateway_str));
    subnet.toString().toCharArray(subnet_str, sizeof(subnet_str));
    primaryDNS.toString().toCharArray(dns1_str, sizeof(dns1_str));
    secondaryDNS.toString().toCharArray(dns2_str, sizeof(dns2_str));
    Serial.printf("Static IP: %s\n", ip_str);
    Serial.printf("Gateway:   %s\n", gateway_str);
    Serial.printf("Subnet:    %s\n", subnet_str);
    Serial.printf("DNS:       %s, %s\n", dns1_str, dns2_str);

    // Configure static IP before connecting
    if (!WiFi.config(staticIP, gateway, subnet, primaryDNS, secondaryDNS)) {
      Serial.println("FATAL: Failed to configure static IP — rebooting in 3s");
      esp_task_wdt_reset();
      delay(3000);
      ESP.restart();
    }
  } else {
    Serial.println("Using DHCP (automatic IP assignment)");
  }

  // Maximum power plus 802.11b is the default long-range/lowest-speed profile.
  WiFi.setTxPower(WIFI_POWER_19_5dBm); // Absolute maximum power: 19.5 dBm
  Serial.println("WiFi transmission power set to MAXIMUM (19.5 dBm)");

  // Aggressive power and range optimizations
  WiFi.setAutoReconnect(true); // Enable automatic reconnection
  WiFi.persistent(false); // Use EEPROM as authoritative store; don't write NVS

  // Apply WiFi bandwidth mode BEFORE WiFi.begin()
  applyWiFiBandwidthMode();
  Serial.println("WiFi bandwidth mode applied from configuration");

  // 5-round boot connection — reboot if all rounds fail
  const int BOOT_MAX_ROUNDS = 5;
  const unsigned long BOOT_ATTEMPT_TIMEOUT_MS = 10000; // 10s per round

  Serial.printf("Connecting to WiFi (max %d attempts)...\n", BOOT_MAX_ROUNDS);

  for (int round = 1; round <= BOOT_MAX_ROUNDS; round++) {
    Serial.printf("Attempt %d/%d ", round, BOOT_MAX_ROUNDS);
    WiFi.begin(configManager.getWiFiSSID(), configManager.getWiFiPassword());

    unsigned long t0 = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - t0) < BOOT_ATTEMPT_TIMEOUT_MS) {
      esp_task_wdt_reset();
      delay(500);
      Serial.print(".");
    }
    Serial.println();

    if (WiFi.status() == WL_CONNECTED) break;

    Serial.printf("Attempt %d failed (status=%d)\n", round, (int)WiFi.status());
    if (round < BOOT_MAX_ROUNDS) {
      WiFi.disconnect();
      delay(2000);
      esp_task_wdt_reset();
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("======== WiFi Connected Successfully ========");
    char ip_str[16];
    WiFi.localIP().toString().toCharArray(ip_str, sizeof(ip_str));
    Serial.printf("IP Address: %s\n", ip_str);
    char gateway_ip_str[16], subnet_mask_str[16], dns_ip_str[16];
    WiFi.gatewayIP().toString().toCharArray(gateway_ip_str, sizeof(gateway_ip_str));
    WiFi.subnetMask().toString().toCharArray(subnet_mask_str, sizeof(subnet_mask_str));
    WiFi.dnsIP().toString().toCharArray(dns_ip_str, sizeof(dns_ip_str));
    Serial.printf("Gateway:    %s\n", gateway_ip_str);
    Serial.printf("Subnet:     %s\n", subnet_mask_str);
    Serial.printf("DNS:        %s\n", dns_ip_str);
    Serial.printf("RSSI:       %d dBm\n", WiFi.RSSI());
    Serial.printf("TX Power:   19.5 dBm (MAXIMUM - Long Range Mode)\n");
    char mac_str[18];
    WiFi.macAddress().toCharArray(mac_str, sizeof(mac_str));
    Serial.printf("MAC:        %s\n", mac_str);
    Serial.printf("Channel:    %d\n", WiFi.channel());
    Serial.println("===========================================");
  } else {
    Serial.println("FATAL: All WiFi boot attempts failed — rebooting in 5s");
    printWiFiScanDiagnostics();
    for (int i = 5; i > 0; i--) {
      Serial.printf("Reboot in %d...\n", i);
      esp_task_wdt_reset();
      delay(1000);
    }
    ESP.restart();
  }
}

// ===================
// INITIALIZATION FUNCTIONS
// ===================

/**
 * Main setup function using modular components
 */
void setup() {
  Serial.begin(115200);
  Serial.setDebugOutput(true);
  Serial.println();
  Serial.println(
      "ESP32-CAM Advanced Capture Server v2.1 - Modular Architecture");
  Serial.println(
      "===============================================================");

  // Initialize crash prevention systems first
  initWatchdog();
  initStackProtection();

  // Initialize configuration manager first
  if (!configManager.begin()) {
    Serial.println("ERROR: Failed to initialize configuration manager");
    return;
  }

  // Initialize hardware components using configuration
  if (!flashManager.begin(configManager.getFlashThreshold())) {
    Serial.println("ERROR: Failed to initialize flash manager");
    return;
  }

  if (!cameraManager.begin(configManager.getJPEGQuality(),
                           configManager.getDefaultResolution())) {
    Serial.println(
        "WARNING: Camera initialization failed - continuing without camera");
    Serial.println("System will run in limited mode (no photo capture)");
    // Continue without camera - system can still provide status and other
    // services
  }

  // Initialize WiFi connection
  initWiFi();

  // Start web server
  if (!webServerManager.begin()) {
    Serial.println("ERROR: Failed to start web server");
    return;
  }

  // Start OTA update service (requires WiFi to be up)
  if (WiFi.status() == WL_CONNECTED) {
    initOTA();
  }

  // Print available endpoints and network information
  Serial.println();
  Serial.println("============ API SERVER READY ============");
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("Device Name:   %s\n", configManager.getDeviceName());
    char ip_str[16];
    WiFi.localIP().toString().toCharArray(ip_str, sizeof(ip_str));
    Serial.printf("API Base URL:  http://%s\n", ip_str);
    Serial.println();
    Serial.println("📡 Available API Endpoints:");
    Serial.printf("  📸 Capture:    http://%s/capture\n", ip_str);
    Serial.printf("  ⚡ Flash:      http://%s/flash\n", ip_str);
    Serial.printf("  🚀 Quick Snap: http://%s/snap\n", ip_str);
    Serial.printf("  📊 Status:     http://%s/status\n", ip_str);
    Serial.printf("  ℹ️  Info:       http://%s/\n", ip_str);
    Serial.println();
    Serial.printf("Mode: API-Only (No Web Interface)\n");
    Serial.printf("Network: %s\n",
                  configManager.useStaticIP() ? "Static IP" : "DHCP");
    Serial.printf("Signal: %d dBm\n", WiFi.RSSI());
    Serial.printf("JPEG Quality: %d\n", configManager.getJPEGQuality());
    char resolution_str[32];
    cameraManager.getResolutionString(configManager.getDefaultResolution(),
                                      resolution_str, sizeof(resolution_str));
    Serial.printf("Default Resolution: %s\n", resolution_str);
  } else {
    Serial.println("❌ WiFi not connected - API unavailable");
  }
  Serial.println("==========================================");
}

/**
 * Ping the gateway every 15s; reboot after 12 consecutive failures (~3 min).
 * Only runs while WiFi is up — WiFi-down path handled by checkWiFiConnection().
 */
void checkGatewayPing() {
  unsigned long now = millis();
  if (now - last_ping_time < PING_CHECK_INTERVAL) return;
  last_ping_time = now;

  if (WiFi.status() != WL_CONNECTED) return;

  esp_task_wdt_reset();
  bool ok = Ping.ping(GATEWAY_PING_IP, 2); // 2 ICMP echo requests
  esp_task_wdt_reset();

  if (ok) {
    if (gateway_ping_fail_count > 0) {
      Serial.printf("Gateway ping restored after %d failure(s)\n", gateway_ping_fail_count);
    }
    gateway_ping_fail_count = 0;
  } else {
    gateway_ping_fail_count++;
    char gw_str[16];
    GATEWAY_PING_IP.toString().toCharArray(gw_str, sizeof(gw_str));
    Serial.printf("Gateway ping FAILED %d/%d (target: %s)\n",
                  gateway_ping_fail_count, PING_FAIL_REBOOT_THRESHOLD, gw_str);
    if (gateway_ping_fail_count >= PING_FAIL_REBOOT_THRESHOLD) {
      Serial.println("FATAL: Gateway unreachable — rebooting now");
      esp_task_wdt_reset();
      delay(500);
      ESP.restart();
    }
  }
}

// ===================
// MAIN LOOP
// ===================

void loop() {
  // Self-restart after 24h — independent of WiFi/server
  if (millis() > DAILY_RESTART_MS) {
    Serial.println("24h uptime reached — scheduled self-restart");
    delay(100);
    ESP.restart();
  }

  // Reset watchdog timer to prevent crashes
  resetWatchdog();

  // Monitor system health
  checkMemoryUsage();
  checkWiFiConnection();
  checkGatewayPing();

  // Check for critical memory conditions
  size_t free_heap = esp_get_free_heap_size();
  if (free_heap < 20000) { // Less than 20KB free
    Serial.println("CRITICAL: Very low memory, triggering emergency recovery");
    emergencyRecovery();
  }

  // Handle deferred WiFi reconnect from /wifi endpoint
  if (wifi_reconnect_requested) {
    wifi_reconnect_requested = false;
    Serial.println("WiFi reconnect requested by web UI...");
    Serial.printf("Using saved credentials - SSID: %s\n", configManager.getWiFiSSID());
    WiFi.disconnect();
    delay(500);
    applyWiFiBandwidthMode();
    WiFi.begin(configManager.getWiFiSSID(), configManager.getWiFiPassword());

    // Wait for WiFi connection before restarting server
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
      delay(500);
      attempts++;
    }

    webServerManager.stop();
    delay(100);
    webServerManager.begin();
    if (WiFi.status() == WL_CONNECTED) {
      gateway_ping_fail_count = 0;
      initOTA();
    }
    Serial.println("HTTP server and OTA restarted after WiFi reconnect");
  }

  // Handle OTA update requests
  ArduinoOTA.handle();

  // Handle incoming HTTP requests using the web server manager
  webServerManager.handleClients();

  // Small delay to prevent watchdog issues
  delay(1);
}
